JWT состоит из трех компонентов, каждый из которых закодирован в Base64Url и разделен точками:
1. Заголовок — обычно в заголовке указывается тип токена (JWT), а также используемый алгоритм подписи.
2. Полезная нагрузка — это тело токена, содержащее фрагмент информации об объекте.
3. Подпись — это часть токена, которая обеспечивает метод проверки его подлинности. Подпись создается с использованием алгоритма, указанного в заголовке JWT. 
# Уязвимости связанные с JWT-токенами

## 1. JWT-токен содержит чувствительные данные

## 2. JWT-токен не имеет срока действия

## 3. Смешивание алгоритмов шифрования(Ассиметричный и симметричный: HS256 и RS256)

## 4. Слишком слабый секретный ключ

## 5. Подпись JWT-токена не проверяется

## 6. Можно подделать алгоритм шифрования на "None", что приведёт к тому, что библиотека, используемая для проверки подписи, всегда будет возвращать true, что позволит вам снова подделывать любые payloads в вашем токене.

## 7. Атака межсерверной ретрансляции, когда в payload токена добавляется {"admin":true,"audience":"app1"}, а затем этот токен используется для доступа к другому приложению, которое не проверяет аудиторию и позволяет получить доступ с правами администратора.
