# Шифрование это процесс преобразования информации в неразборчивый формат, который может быть прочитан только с помощью специального ключа или пароля. Если ключ не нужен, то этот механизм небезопасен.

# Процесс шифрование делит исходное сообщение на блоки определенного размера(например в AES это 16 байт) и применяет математические операции к каждому блоку.

# Симметричное шифрование использует один и тот же ключ для шифрования и дешифрования данных. Это означает, что обе стороны должны иметь доступ к этому ключу, что может быть проблемой при передаче ключа по незащищенным каналам.

